       01  :PREFIX:-AJU-RET    PIC 9(01).
           88 :PREFIX:-AJU-RET-OK        VALUE 0.
           88 :PREFIX:-AJU-RET-ERR       VALUE 1.
           88 :PREFIX:-AJU-RET-FK-ERR    VALUE 2.