       01  :PREFIX:-LIR-RET    PIC 9(01).
           88 :PREFIX:-LIR-RET-OK        VALUE 0.
           88 :PREFIX:-LIR-RET-ERR       VALUE 1.
           88 :PREFIX:-LIR-RET-VID       VALUE 2.
           