       01  :PREFIX:-MAJ-RET    PIC 9(01).
           88 :PREFIX:-MAJ-RET-OK        VALUE 0.
           88 :PREFIX:-MAJ-RET-ERR       VALUE 1.
           88 :PREFIX:-MAJ-RET-FK-ERR    VALUE 2.
           