       01  :PREFIX:-SUP-RET    PIC 9(01).
           88 :PREFIX:-SUP-RET-OK        VALUE 0.
           88 :PREFIX:-SUP-RET-ERR       VALUE 1.
           88 :PREFIX:-SUP-RET-FK-ERR    VALUE 2.